yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8al3le8a.h
/* Alarm A register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ALSU        : 4;
  unsigned char ALST        : 3;
  unsigned char MSK1        : 1;
} __BITS_RTC_ALRMAR1;
#endif
__IO_REG8_BIT(RTC_ALRMAR1, 0x515C, __READ_WRITE, __BITS_RTC_ALRMAR1);

/* Alarm A register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ALMNU       : 4;
  unsigned char ALMNT       : 3;
  unsigned char MSK2        : 1;
} __BITS_RTC_ALRMAR2;
#endif
__IO_REG8_BIT(RTC_ALRMAR2, 0x515D, __READ_WRITE, __BITS_RTC_ALRMAR2);

/* Alarm A register 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ALHU        : 4;
  unsigned char ALHT        : 2;
  unsigned char PM          : 1;
  unsigned char MSK3        : 1;
} __BITS_RTC_ALRMAR3;
#endif
__IO_REG8_BIT(RTC_ALRMAR3, 0x515E, __READ_WRITE, __BITS_RTC_ALRMAR3);

/* Alarm A register 4 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ALDU        : 4;
  unsigned char ALDT        : 2;
  unsigned char WDSEL       : 1;
  unsigned char MSK4        : 1;
} __BITS_RTC_ALRMAR4;
#endif
__IO_REG8_BIT(RTC_ALRMAR4, 0x515F, __READ_WRITE, __BITS_RTC_ALRMAR4);

/* Alarm A subsecond register high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ALSS8       : 1;
  unsigned char ALSS9       : 1;
  unsigned char ALSS10      : 1;
  unsigned char ALSS11      : 1;
  unsigned char ALSS12      : 1;
  unsigned char ALSS13      : 1;
  unsigned char ALSS14      : 1;
} __BITS_RTC_ALRMASSRH;
#endif
__IO_REG8_BIT(RTC_ALRMASSRH, 0x5164, __READ_WRITE, __BITS_RTC_ALRMASSRH);

/* Alarm A subsecond register low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ALSS0       : 1;
  unsigned char ALSS1       : 1;
  unsigned char ALSS2       : 1;
  unsigned char ALSS3       : 1;
  unsigned char ALSS4       : 1;
  unsigned char ALSS5       : 1;
  unsigned char ALSS6       : 1;
  unsigned char ALSS7       : 1;
} __BITS_RTC_ALRMASSRL;
#endif
__IO_REG8_BIT(RTC_ALRMASSRL, 0x5165, __READ_WRITE, __BITS_RTC_ALRMASSRL);

/* Alarm A masking register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char MASKSS0     : 1;
  unsigned char MASKSS1     : 1;
  unsigned char MASKSS2     : 1;
  unsigned char MASKSS3     : 1;
} __BITS_RTC_ALRMASSMSKR;
#endif
__IO_REG8_BIT(RTC_ALRMASSMSKR, 0x5166, __READ_WRITE, __BITS_RTC_ALRMASSMSKR);

/* Calibration register high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CALM8       : 1;
  unsigned char             : 4;
  unsigned char CALW16      : 1;
  unsigned char CALW8       : 1;
  unsigned char CALP        : 1;
} __BITS_RTC_CALRH;
#endif
__IO_REG8_BIT(RTC_CALRH,   0x516A, __READ_WRITE, __BITS_RTC_CALRH);

/* Calibration register low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CALM0       : 1;
  unsigned char CALM1       : 1;
  unsigned char CALM2       : 1;
  unsigned char CALM3       : 1;
  unsigned char CALM4       : 1;
  unsigned char CALM5       : 1;
  unsigned char CALM6       : 1;
  unsigned char CALM7       : 1;
} __BITS_RTC_CALRL;
#endif
__IO_REG8_BIT(RTC_CALRL,   0x516B, __READ_WRITE, __BITS_RTC_CALRL);

/* Tamper control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char TAMPIE      : 1;
  unsigned char TAMP1E      : 1;
  unsigned char TAMP1LEVEL  : 1;
  unsigned char TAMP2E      : 1;
  unsigned char TAMP2LEVEL  : 1;
  unsigned char TAMP3E      : 1;
  unsigned char TAMP3LEVEL  : 1;
} __BITS_RTC_TCR1;
#endif
__IO_REG8_BIT(RTC_TCR1,    0x516C, __READ_WRITE, __BITS_RTC_TCR1);

/* Tamper control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char TAMPFREQ    : 3;
  unsigned char TAMPFLT     : 2;
  unsigned char TAMPPRCH    : 2;
  unsigned char TAMPPUDIS   : 1;
} __BITS_RTC_TCR2;
#endif
__IO_REG8_BIT(RTC_TCR2,    0x516D, __READ_WRITE, __BITS_RTC_TCR2);

/* CSS on LSE control and status register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CSSEN       : 1;
  unsigned char SWITCHEN    : 1;
  unsigned char CSSIE       : 1;
  unsigned char CSSF        : 1;
  unsigned char SWITCHF     : 1;
} __BITS_CSS_LSE_CSR;
#endif
__IO_REG8_BIT(CSS_LSE_CSR, 0x5190, __READ_WRITE, __BITS_CSS_LSE_CSR);


/*-------------------------------------------------------------------------
 *      RTC bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define RTC_TR1_SU               RTC_TR1_bit.SU
#define RTC_TR1_ST               RTC_TR1_bit.ST

#define RTC_TR2_MNU              RTC_TR2_bit.MNU
#define RTC_TR2_MNT              RTC_TR2_bit.MNT

#define RTC_TR3_HU               RTC_TR3_bit.HU
#define RTC_TR3_HT               RTC_TR3_bit.HT
#define RTC_TR3_PM               RTC_TR3_bit.PM

#define RTC_DR1_DU               RTC_DR1_bit.DU
#define RTC_DR1_DT               RTC_DR1_bit.DT

#define RTC_DR2_MU               RTC_DR2_bit.MU
#define RTC_DR2_MT               RTC_DR2_bit.MT
#define RTC_DR2_WDU              RTC_DR2_bit.WDU

#define RTC_DR3_YU               RTC_DR3_bit.YU
#define RTC_DR3_YT               RTC_DR3_bit.YT

#define RTC_CR1_WUCKSEL          RTC_CR1_bit.WUCKSEL
#define RTC_CR1_RATIO            RTC_CR1_bit.RATIO
#define RTC_CR1_FMT              RTC_CR1_bit.FMT

#define RTC_CR2_ALRAE            RTC_CR2_bit.ALRAE
#define RTC_CR2_WUTE             RTC_CR2_bit.WUTE
#define RTC_CR2_ALRAIE           RTC_CR2_bit.ALRAIE
#define RTC_CR2_WUTIE            RTC_CR2_bit.WUTIE

#define RTC_CR3_ADD1H            RTC_CR3_bit.ADD1H
#define RTC_CR3_SUB1H            RTC_CR3_bit.SUB1H
#define RTC_CR3_BCK              RTC_CR3_bit.BCK
#define RTC_CR3_POL              RTC_CR3_bit.POL
#define RTC_CR3_OSEL             RTC_CR3_bit.OSEL
#define RTC_CR3_COE              RTC_CR3_bit.COE

#define RTC_ISR1_ALRAWF          RTC_ISR1_bit.ALRAWF
#define RTC_ISR1_RECALPF         RTC_ISR1_bit.RECALPF
#define RTC_ISR1_WUTWF           RTC_ISR1_bit.WUTWF
#define RTC_ISR1_SHPF            RTC_ISR1_bit.SHPF
#define RTC_ISR1_INITS           RTC_ISR1_bit.INITS
#define RTC_ISR1_RSF             RTC_ISR1_bit.RSF
#define RTC_ISR1_INITF           RTC_ISR1_bit.INITF
#define RTC_ISR1_INIT            RTC_ISR1_bit.INIT

