yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8al3le8a.h
#define MASK_SPI2_CR2_SSI        0x01
#define MASK_SPI2_CR2_SSM        0x02
#define MASK_SPI2_CR2_RXONLY     0x04
#define MASK_SPI2_CR2_CRCNEXT    0x10
#define MASK_SPI2_CR2_CRCEN      0x20
#define MASK_SPI2_CR2_BDOE       0x40
#define MASK_SPI2_CR2_BDM        0x80

#define MASK_SPI2_ICR_RXDMAEN    0x01
#define MASK_SPI2_ICR_TXDMAEN    0x02
#define MASK_SPI2_ICR_WKIE       0x10
#define MASK_SPI2_ICR_ERRIE      0x20
#define MASK_SPI2_ICR_RXIE       0x40
#define MASK_SPI2_ICR_TXIE       0x80

#define MASK_SPI2_SR_RXNE        0x01
#define MASK_SPI2_SR_TXE         0x02
#define MASK_SPI2_SR_WKUP        0x08
#define MASK_SPI2_SR_CRCERR      0x10
#define MASK_SPI2_SR_MODF        0x20
#define MASK_SPI2_SR_OVR         0x40
#define MASK_SPI2_SR_BSY         0x80

#define MASK_SPI2_TXCRCR_TXCRC   0x7F


/*-------------------------------------------------------------------------
 *      AES register definitions
 *-----------------------------------------------------------------------*/
/* AES control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char EN          : 1;
  unsigned char MODE        : 2;
  unsigned char CCFC        : 1;
  unsigned char ERRFC       : 1;
  unsigned char CCIE        : 1;
  unsigned char ERRIE       : 1;
  unsigned char DMAEN       : 1;
} __BITS_AES_CR;
#endif
__IO_REG8_BIT(AES_CR,      0x53D0, __READ_WRITE, __BITS_AES_CR);

/* AES status register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CCF         : 1;
  unsigned char RDERR       : 1;
  unsigned char WRERR       : 1;
} __BITS_AES_SR;
#endif
__IO_REG8_BIT(AES_SR,      0x53D1, __READ, __BITS_AES_SR);

/* AES data input register */
__IO_REG8    (AES_DINR,    0x53D2, __READ_WRITE);
/* AES data output register */
__IO_REG8    (AES_DOUTR,   0x53D3, __READ);

/*-------------------------------------------------------------------------
 *      AES bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define AES_CR_EN                AES_CR_bit.EN
#define AES_CR_MODE              AES_CR_bit.MODE
#define AES_CR_CCFC              AES_CR_bit.CCFC
#define AES_CR_ERRFC             AES_CR_bit.ERRFC
#define AES_CR_CCIE              AES_CR_bit.CCIE
#define AES_CR_ERRIE             AES_CR_bit.ERRIE
#define AES_CR_DMAEN             AES_CR_bit.DMAEN

#define AES_SR_CCF               AES_SR_bit.CCF
#define AES_SR_RDERR             AES_SR_bit.RDERR
#define AES_SR_WRERR             AES_SR_bit.WRERR

#endif

/*-------------------------------------------------------------------------
 *      AES bit masks
 *-----------------------------------------------------------------------*/
#define MASK_AES_CR_EN           0x01
#define MASK_AES_CR_MODE         0x06
#define MASK_AES_CR_CCFC         0x08
#define MASK_AES_CR_ERRFC        0x10
#define MASK_AES_CR_CCIE         0x20
#define MASK_AES_CR_ERRIE        0x40
#define MASK_AES_CR_DMAEN        0x80

#define MASK_AES_SR_CCF          0x01
#define MASK_AES_SR_RDERR        0x02
#define MASK_AES_SR_WRERR        0x04


/*-------------------------------------------------------------------------
 *      USART2 register definitions
 *-----------------------------------------------------------------------*/
/* USART2 status register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PE          : 1;
  unsigned char FE          : 1;
  unsigned char NF          : 1;
  unsigned char OR          : 1;
  unsigned char IDLE        : 1;
  unsigned char RXNE        : 1;
  unsigned char TC          : 1;
  unsigned char TXE         : 1;
} __BITS_USART2_SR;
#endif
__IO_REG8_BIT(USART2_SR,   0x53E0, __READ, __BITS_USART2_SR);

/* USART2 data register */
__IO_REG8    (USART2_DR,   0x53E1, __READ_WRITE);
/* USART2 baud rate register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char USART_DIV4  : 1;
  unsigned char USART_DIV5  : 1;
  unsigned char USART_DIV6  : 1;
  unsigned char USART_DIV7  : 1;
  unsigned char USART_DIV8  : 1;
  unsigned char USART_DIV9  : 1;
  unsigned char USART_DIV10 : 1;
  unsigned char USART_DIV11 : 1;
} __BITS_USART2_BRR1;
#endif
__IO_REG8_BIT(USART2_BRR1, 0x53E2, __READ_WRITE, __BITS_USART2_BRR1);

/* USART2 baud rate register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char USART_DIV0  : 1;
  unsigned char USART_DIV1  : 1;
  unsigned char USART_DIV2  : 1;
  unsigned char USART_DIV3  : 1;
  unsigned char USART_DIV12 : 1;
  unsigned char USART_DIV13 : 1;
  unsigned char USART_DIV14 : 1;
  unsigned char USART_DIV15 : 1;
} __BITS_USART2_BRR2;
#endif
__IO_REG8_BIT(USART2_BRR2, 0x53E3, __READ_WRITE, __BITS_USART2_BRR2);

/* USART2 control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PIEN        : 1;
  unsigned char PS          : 1;
  unsigned char PCEN        : 1;
  unsigned char WAKE        : 1;
  unsigned char M           : 1;
  unsigned char USARTD      : 1;
  unsigned char T8          : 1;
  unsigned char R8          : 1;
} __BITS_USART2_CR1;
#endif
__IO_REG8_BIT(USART2_CR1,  0x53E4, __READ_WRITE, __BITS_USART2_CR1);

/* USART2 control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SBK         : 1;
  unsigned char RWU         : 1;
  unsigned char REN         : 1;
  unsigned char TEN         : 1;
  unsigned char ILIEN       : 1;
  unsigned char RIEN        : 1;
  unsigned char TCIEN       : 1;
  unsigned char TIEN        : 1;
} __BITS_USART2_CR2;
#endif
__IO_REG8_BIT(USART2_CR2,  0x53E5, __READ_WRITE, __BITS_USART2_CR2);

/* USART2 control register 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char LBCL        : 1;
  unsigned char CPHA        : 1;
  unsigned char CPOL        : 1;
  unsigned char CLKEN       : 1;
  unsigned char STOP        : 2;
} __BITS_USART2_CR3;
#endif
__IO_REG8_BIT(USART2_CR3,  0x53E6, __READ_WRITE, __BITS_USART2_CR3);

/* USART2 control register 4 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ADD         : 4;
} __BITS_USART2_CR4;
#endif
__IO_REG8_BIT(USART2_CR4,  0x53E7, __READ_WRITE, __BITS_USART2_CR4);

/* USART2 control register 5 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char EIE         : 1;
  unsigned char IREN        : 1;
  unsigned char IRLP        : 1;
  unsigned char HDSEL       : 1;
  unsigned char NACK        : 1;
  unsigned char SCEN        : 1;
  unsigned char DMAR        : 1;
  unsigned char DMAT        : 1;
} __BITS_USART2_CR5;
#endif
__IO_REG8_BIT(USART2_CR5,  0x53E8, __READ_WRITE, __BITS_USART2_CR5);

/* USART2 guard time register */
__IO_REG8    (USART2_GTR,  0x53E9, __READ_WRITE);
/* USART2 prescaler register */
__IO_REG8    (USART2_PSCR, 0x53EA, __READ_WRITE);

/*-------------------------------------------------------------------------
 *      USART2 bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

