yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8al3le8a.h
/* LCD display memory 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S016        : 1;
  unsigned char S017        : 1;
  unsigned char S018        : 1;
  unsigned char S019        : 1;
  unsigned char S020        : 1;
  unsigned char S021        : 1;
  unsigned char S022        : 1;
  unsigned char S023        : 1;
} __BITS_LCD_RAM2;
#endif
__IO_REG8_BIT(LCD_RAM2,    0x540E, __READ_WRITE, __BITS_LCD_RAM2);

/* LCD display memory 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S024        : 1;
  unsigned char S025        : 1;
  unsigned char S026        : 1;
  unsigned char S027        : 1;
  unsigned char S100        : 1;
  unsigned char S101        : 1;
  unsigned char S102        : 1;
  unsigned char S103        : 1;
} __BITS_LCD_RAM3;
#endif
__IO_REG8_BIT(LCD_RAM3,    0x540F, __READ_WRITE, __BITS_LCD_RAM3);

/* LCD display memory 4 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S104        : 1;
  unsigned char S105        : 1;
  unsigned char S106        : 1;
  unsigned char S107        : 1;
  unsigned char S108        : 1;
  unsigned char S109        : 1;
  unsigned char S110        : 1;
  unsigned char S111        : 1;
} __BITS_LCD_RAM4;
#endif
__IO_REG8_BIT(LCD_RAM4,    0x5410, __READ_WRITE, __BITS_LCD_RAM4);

/* LCD display memory 5 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S112        : 1;
  unsigned char S113        : 1;
  unsigned char S114        : 1;
  unsigned char S115        : 1;
  unsigned char S116        : 1;
  unsigned char S117        : 1;
  unsigned char S118        : 1;
  unsigned char S119        : 1;
} __BITS_LCD_RAM5;
#endif
__IO_REG8_BIT(LCD_RAM5,    0x5411, __READ_WRITE, __BITS_LCD_RAM5);

/* LCD display memory 6 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S120        : 1;
  unsigned char S121        : 1;
  unsigned char S122        : 1;
  unsigned char S123        : 1;
  unsigned char S124        : 1;
  unsigned char S125        : 1;
  unsigned char S126        : 1;
  unsigned char S127        : 1;
} __BITS_LCD_RAM6;
#endif
__IO_REG8_BIT(LCD_RAM6,    0x5412, __READ_WRITE, __BITS_LCD_RAM6);

/* LCD display memory 7 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S200        : 1;
  unsigned char S201        : 1;
  unsigned char S202        : 1;
  unsigned char S203        : 1;
  unsigned char S204        : 1;
  unsigned char S205        : 1;
  unsigned char S206        : 1;
  unsigned char S207        : 1;
} __BITS_LCD_RAM7;
#endif
__IO_REG8_BIT(LCD_RAM7,    0x5413, __READ_WRITE, __BITS_LCD_RAM7);

/* LCD display memory 8 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S208        : 1;
  unsigned char S209        : 1;
  unsigned char S210        : 1;
  unsigned char S211        : 1;
  unsigned char S212        : 1;
  unsigned char S213        : 1;
  unsigned char S214        : 1;
  unsigned char S215        : 1;
} __BITS_LCD_RAM8;
#endif
__IO_REG8_BIT(LCD_RAM8,    0x5414, __READ_WRITE, __BITS_LCD_RAM8);

/* LCD display memory 9 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S216        : 1;
  unsigned char S217        : 1;
  unsigned char S218        : 1;
  unsigned char S219        : 1;
  unsigned char S220        : 1;
  unsigned char S221        : 1;
  unsigned char S222        : 1;
  unsigned char S223        : 1;
} __BITS_LCD_RAM9;
#endif
__IO_REG8_BIT(LCD_RAM9,    0x5415, __READ_WRITE, __BITS_LCD_RAM9);

/* LCD display memory 10 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S224        : 1;
  unsigned char S225        : 1;
  unsigned char S226        : 1;
  unsigned char S227        : 1;
  unsigned char S300        : 1;
  unsigned char S301        : 1;
  unsigned char S302        : 1;
  unsigned char S303        : 1;
} __BITS_LCD_RAM10;
#endif
__IO_REG8_BIT(LCD_RAM10,   0x5416, __READ_WRITE, __BITS_LCD_RAM10);

/* LCD display memory 11 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S304        : 1;
  unsigned char S305        : 1;
  unsigned char S306        : 1;
  unsigned char S307        : 1;
  unsigned char S308        : 1;
  unsigned char S309        : 1;
  unsigned char S310        : 1;
  unsigned char S311        : 1;
} __BITS_LCD_RAM11;
#endif
__IO_REG8_BIT(LCD_RAM11,   0x5417, __READ_WRITE, __BITS_LCD_RAM11);

/* LCD display memory 12 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S312        : 1;
  unsigned char S313        : 1;
  unsigned char S314        : 1;
  unsigned char S315        : 1;
  unsigned char S316        : 1;
  unsigned char S317        : 1;
  unsigned char S318        : 1;
  unsigned char S319        : 1;
} __BITS_LCD_RAM12;
#endif
__IO_REG8_BIT(LCD_RAM12,   0x5418, __READ_WRITE, __BITS_LCD_RAM12);

/* LCD display memory 13 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S320        : 1;
  unsigned char S321        : 1;
  unsigned char S322        : 1;
  unsigned char S323        : 1;
  unsigned char S324        : 1;
  unsigned char S305        : 1;
  unsigned char S306        : 1;
  unsigned char S327        : 1;
} __BITS_LCD_RAM13;
#endif
__IO_REG8_BIT(LCD_RAM13,   0x5419, __READ_WRITE, __BITS_LCD_RAM13);

/* LCD display memory 12 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S028        : 1;
  unsigned char S029        : 1;
  unsigned char S030        : 1;
  unsigned char S031        : 1;
  unsigned char S032        : 1;
  unsigned char S033        : 1;
  unsigned char S034        : 1;
  unsigned char S035        : 1;
} __BITS_LCD_RAM14;
#endif
__IO_REG8_BIT(LCD_RAM14,   0x541A, __READ_WRITE, __BITS_LCD_RAM14);

/* LCD display memory 13 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S036        : 1;
  unsigned char S037        : 1;
  unsigned char S038        : 1;
  unsigned char S039        : 1;
  unsigned char S040        : 1;
  unsigned char S041        : 1;
  unsigned char S042        : 1;
  unsigned char S043        : 1;
} __BITS_LCD_RAM15;
#endif
__IO_REG8_BIT(LCD_RAM15,   0x541B, __READ_WRITE, __BITS_LCD_RAM15);

