yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8al3le8a.h
#define LCD_PM5_SEG40            LCD_PM5_bit.SEG40
#define LCD_PM5_SEG41            LCD_PM5_bit.SEG41
#define LCD_PM5_SEG42            LCD_PM5_bit.SEG42
#define LCD_PM5_SEG43            LCD_PM5_bit.SEG43

#define LCD_RAM0_S000            LCD_RAM0_bit.S000
#define LCD_RAM0_S001            LCD_RAM0_bit.S001
#define LCD_RAM0_S002            LCD_RAM0_bit.S002
#define LCD_RAM0_S003            LCD_RAM0_bit.S003
#define LCD_RAM0_S004            LCD_RAM0_bit.S004
#define LCD_RAM0_S005            LCD_RAM0_bit.S005
#define LCD_RAM0_S006            LCD_RAM0_bit.S006
#define LCD_RAM0_S007            LCD_RAM0_bit.S007

#define LCD_RAM1_S008            LCD_RAM1_bit.S008
#define LCD_RAM1_S009            LCD_RAM1_bit.S009
#define LCD_RAM1_S010            LCD_RAM1_bit.S010
#define LCD_RAM1_S011            LCD_RAM1_bit.S011
#define LCD_RAM1_S012            LCD_RAM1_bit.S012
#define LCD_RAM1_S013            LCD_RAM1_bit.S013
#define LCD_RAM1_S014            LCD_RAM1_bit.S014
#define LCD_RAM1_S015            LCD_RAM1_bit.S015

#define LCD_RAM2_S016            LCD_RAM2_bit.S016
#define LCD_RAM2_S017            LCD_RAM2_bit.S017
#define LCD_RAM2_S018            LCD_RAM2_bit.S018
#define LCD_RAM2_S019            LCD_RAM2_bit.S019
#define LCD_RAM2_S020            LCD_RAM2_bit.S020
#define LCD_RAM2_S021            LCD_RAM2_bit.S021
#define LCD_RAM2_S022            LCD_RAM2_bit.S022
#define LCD_RAM2_S023            LCD_RAM2_bit.S023

#define LCD_RAM3_S024            LCD_RAM3_bit.S024
#define LCD_RAM3_S025            LCD_RAM3_bit.S025
#define LCD_RAM3_S026            LCD_RAM3_bit.S026
#define LCD_RAM3_S027            LCD_RAM3_bit.S027
#define LCD_RAM3_S100            LCD_RAM3_bit.S100
#define LCD_RAM3_S101            LCD_RAM3_bit.S101
#define LCD_RAM3_S102            LCD_RAM3_bit.S102
#define LCD_RAM3_S103            LCD_RAM3_bit.S103

#define LCD_RAM4_S104            LCD_RAM4_bit.S104
#define LCD_RAM4_S105            LCD_RAM4_bit.S105
#define LCD_RAM4_S106            LCD_RAM4_bit.S106
#define LCD_RAM4_S107            LCD_RAM4_bit.S107
#define LCD_RAM4_S108            LCD_RAM4_bit.S108
#define LCD_RAM4_S109            LCD_RAM4_bit.S109
#define LCD_RAM4_S110            LCD_RAM4_bit.S110
#define LCD_RAM4_S111            LCD_RAM4_bit.S111

#define LCD_RAM5_S112            LCD_RAM5_bit.S112
#define LCD_RAM5_S113            LCD_RAM5_bit.S113
#define LCD_RAM5_S114            LCD_RAM5_bit.S114
#define LCD_RAM5_S115            LCD_RAM5_bit.S115
#define LCD_RAM5_S116            LCD_RAM5_bit.S116
#define LCD_RAM5_S117            LCD_RAM5_bit.S117
#define LCD_RAM5_S118            LCD_RAM5_bit.S118
#define LCD_RAM5_S119            LCD_RAM5_bit.S119

#define LCD_RAM6_S120            LCD_RAM6_bit.S120
#define LCD_RAM6_S121            LCD_RAM6_bit.S121
#define LCD_RAM6_S122            LCD_RAM6_bit.S122
#define LCD_RAM6_S123            LCD_RAM6_bit.S123
#define LCD_RAM6_S124            LCD_RAM6_bit.S124
#define LCD_RAM6_S125            LCD_RAM6_bit.S125
#define LCD_RAM6_S126            LCD_RAM6_bit.S126
#define LCD_RAM6_S127            LCD_RAM6_bit.S127

#define LCD_RAM7_S200            LCD_RAM7_bit.S200
#define LCD_RAM7_S201            LCD_RAM7_bit.S201
#define LCD_RAM7_S202            LCD_RAM7_bit.S202
#define LCD_RAM7_S203            LCD_RAM7_bit.S203
#define LCD_RAM7_S204            LCD_RAM7_bit.S204
#define LCD_RAM7_S205            LCD_RAM7_bit.S205
#define LCD_RAM7_S206            LCD_RAM7_bit.S206
#define LCD_RAM7_S207            LCD_RAM7_bit.S207

#define LCD_RAM8_S208            LCD_RAM8_bit.S208
#define LCD_RAM8_S209            LCD_RAM8_bit.S209
#define LCD_RAM8_S210            LCD_RAM8_bit.S210
#define LCD_RAM8_S211            LCD_RAM8_bit.S211
#define LCD_RAM8_S212            LCD_RAM8_bit.S212
#define LCD_RAM8_S213            LCD_RAM8_bit.S213
#define LCD_RAM8_S214            LCD_RAM8_bit.S214
#define LCD_RAM8_S215            LCD_RAM8_bit.S215

#define LCD_RAM9_S216            LCD_RAM9_bit.S216
#define LCD_RAM9_S217            LCD_RAM9_bit.S217
#define LCD_RAM9_S218            LCD_RAM9_bit.S218
#define LCD_RAM9_S219            LCD_RAM9_bit.S219
#define LCD_RAM9_S220            LCD_RAM9_bit.S220
#define LCD_RAM9_S221            LCD_RAM9_bit.S221
#define LCD_RAM9_S222            LCD_RAM9_bit.S222
#define LCD_RAM9_S223            LCD_RAM9_bit.S223

#define LCD_RAM10_S224           LCD_RAM10_bit.S224
#define LCD_RAM10_S225           LCD_RAM10_bit.S225
#define LCD_RAM10_S226           LCD_RAM10_bit.S226
#define LCD_RAM10_S227           LCD_RAM10_bit.S227
#define LCD_RAM10_S300           LCD_RAM10_bit.S300
#define LCD_RAM10_S301           LCD_RAM10_bit.S301
#define LCD_RAM10_S302           LCD_RAM10_bit.S302
#define LCD_RAM10_S303           LCD_RAM10_bit.S303

#define LCD_RAM11_S304           LCD_RAM11_bit.S304
#define LCD_RAM11_S305           LCD_RAM11_bit.S305
#define LCD_RAM11_S306           LCD_RAM11_bit.S306
#define LCD_RAM11_S307           LCD_RAM11_bit.S307
#define LCD_RAM11_S308           LCD_RAM11_bit.S308
#define LCD_RAM11_S309           LCD_RAM11_bit.S309
#define LCD_RAM11_S310           LCD_RAM11_bit.S310
#define LCD_RAM11_S311           LCD_RAM11_bit.S311

#define LCD_RAM12_S312           LCD_RAM12_bit.S312
#define LCD_RAM12_S313           LCD_RAM12_bit.S313
#define LCD_RAM12_S314           LCD_RAM12_bit.S314
#define LCD_RAM12_S315           LCD_RAM12_bit.S315
#define LCD_RAM12_S316           LCD_RAM12_bit.S316
#define LCD_RAM12_S317           LCD_RAM12_bit.S317
#define LCD_RAM12_S318           LCD_RAM12_bit.S318
#define LCD_RAM12_S319           LCD_RAM12_bit.S319

#define LCD_RAM13_S320           LCD_RAM13_bit.S320
#define LCD_RAM13_S321           LCD_RAM13_bit.S321
#define LCD_RAM13_S322           LCD_RAM13_bit.S322
#define LCD_RAM13_S323           LCD_RAM13_bit.S323
#define LCD_RAM13_S324           LCD_RAM13_bit.S324
#define LCD_RAM13_S305           LCD_RAM13_bit.S305
#define LCD_RAM13_S306           LCD_RAM13_bit.S306
#define LCD_RAM13_S327           LCD_RAM13_bit.S327

#define LCD_RAM14_S028           LCD_RAM14_bit.S028
#define LCD_RAM14_S029           LCD_RAM14_bit.S029
#define LCD_RAM14_S030           LCD_RAM14_bit.S030
#define LCD_RAM14_S031           LCD_RAM14_bit.S031
#define LCD_RAM14_S032           LCD_RAM14_bit.S032
#define LCD_RAM14_S033           LCD_RAM14_bit.S033
#define LCD_RAM14_S034           LCD_RAM14_bit.S034
#define LCD_RAM14_S035           LCD_RAM14_bit.S035

#define LCD_RAM15_S036           LCD_RAM15_bit.S036
#define LCD_RAM15_S037           LCD_RAM15_bit.S037
#define LCD_RAM15_S038           LCD_RAM15_bit.S038
#define LCD_RAM15_S039           LCD_RAM15_bit.S039
#define LCD_RAM15_S040           LCD_RAM15_bit.S040
#define LCD_RAM15_S041           LCD_RAM15_bit.S041
#define LCD_RAM15_S042           LCD_RAM15_bit.S042
#define LCD_RAM15_S043           LCD_RAM15_bit.S043

#define LCD_RAM16_S128           LCD_RAM16_bit.S128
#define LCD_RAM16_S129           LCD_RAM16_bit.S129
#define LCD_RAM16_S130           LCD_RAM16_bit.S130
#define LCD_RAM16_S131           LCD_RAM16_bit.S131
#define LCD_RAM16_S132           LCD_RAM16_bit.S132
#define LCD_RAM16_S133           LCD_RAM16_bit.S133
#define LCD_RAM16_S134           LCD_RAM16_bit.S134
#define LCD_RAM16_S135           LCD_RAM16_bit.S135

#define LCD_RAM17_S136           LCD_RAM17_bit.S136
#define LCD_RAM17_S137           LCD_RAM17_bit.S137
#define LCD_RAM17_S138           LCD_RAM17_bit.S138
#define LCD_RAM17_S139           LCD_RAM17_bit.S139
#define LCD_RAM17_S140           LCD_RAM17_bit.S140
#define LCD_RAM17_S141           LCD_RAM17_bit.S141
#define LCD_RAM17_S142           LCD_RAM17_bit.S142
#define LCD_RAM17_S143           LCD_RAM17_bit.S143

