yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8al3le8a.h
#define MASK_LCD_RAM4_S104       0x01
#define MASK_LCD_RAM4_S105       0x02
#define MASK_LCD_RAM4_S106       0x04
#define MASK_LCD_RAM4_S107       0x08
#define MASK_LCD_RAM4_S108       0x10
#define MASK_LCD_RAM4_S109       0x20
#define MASK_LCD_RAM4_S110       0x40
#define MASK_LCD_RAM4_S111       0x80

#define MASK_LCD_RAM5_S112       0x01
#define MASK_LCD_RAM5_S113       0x02
#define MASK_LCD_RAM5_S114       0x04
#define MASK_LCD_RAM5_S115       0x08
#define MASK_LCD_RAM5_S116       0x10
#define MASK_LCD_RAM5_S117       0x20
#define MASK_LCD_RAM5_S118       0x40
#define MASK_LCD_RAM5_S119       0x80

#define MASK_LCD_RAM6_S120       0x01
#define MASK_LCD_RAM6_S121       0x02
#define MASK_LCD_RAM6_S122       0x04
#define MASK_LCD_RAM6_S123       0x08
#define MASK_LCD_RAM6_S124       0x10
#define MASK_LCD_RAM6_S125       0x20
#define MASK_LCD_RAM6_S126       0x40
#define MASK_LCD_RAM6_S127       0x80

#define MASK_LCD_RAM7_S200       0x01
#define MASK_LCD_RAM7_S201       0x02
#define MASK_LCD_RAM7_S202       0x04
#define MASK_LCD_RAM7_S203       0x08
#define MASK_LCD_RAM7_S204       0x10
#define MASK_LCD_RAM7_S205       0x20
#define MASK_LCD_RAM7_S206       0x40
#define MASK_LCD_RAM7_S207       0x80

#define MASK_LCD_RAM8_S208       0x01
#define MASK_LCD_RAM8_S209       0x02
#define MASK_LCD_RAM8_S210       0x04
#define MASK_LCD_RAM8_S211       0x08
#define MASK_LCD_RAM8_S212       0x10
#define MASK_LCD_RAM8_S213       0x20
#define MASK_LCD_RAM8_S214       0x40
#define MASK_LCD_RAM8_S215       0x80

#define MASK_LCD_RAM9_S216       0x01
#define MASK_LCD_RAM9_S217       0x02
#define MASK_LCD_RAM9_S218       0x04
#define MASK_LCD_RAM9_S219       0x08
#define MASK_LCD_RAM9_S220       0x10
#define MASK_LCD_RAM9_S221       0x20
#define MASK_LCD_RAM9_S222       0x40
#define MASK_LCD_RAM9_S223       0x80

#define MASK_LCD_RAM10_S224      0x01
#define MASK_LCD_RAM10_S225      0x02
#define MASK_LCD_RAM10_S226      0x04
#define MASK_LCD_RAM10_S227      0x08
#define MASK_LCD_RAM10_S300      0x10
#define MASK_LCD_RAM10_S301      0x20
#define MASK_LCD_RAM10_S302      0x40
#define MASK_LCD_RAM10_S303      0x80

#define MASK_LCD_RAM11_S304      0x01
#define MASK_LCD_RAM11_S305      0x02
#define MASK_LCD_RAM11_S306      0x04
#define MASK_LCD_RAM11_S307      0x08
#define MASK_LCD_RAM11_S308      0x10
#define MASK_LCD_RAM11_S309      0x20
#define MASK_LCD_RAM11_S310      0x40
#define MASK_LCD_RAM11_S311      0x80

#define MASK_LCD_RAM12_S312      0x01
#define MASK_LCD_RAM12_S313      0x02
#define MASK_LCD_RAM12_S314      0x04
#define MASK_LCD_RAM12_S315      0x08
#define MASK_LCD_RAM12_S316      0x10
#define MASK_LCD_RAM12_S317      0x20
#define MASK_LCD_RAM12_S318      0x40
#define MASK_LCD_RAM12_S319      0x80

#define MASK_LCD_RAM13_S320      0x01
#define MASK_LCD_RAM13_S321      0x02
#define MASK_LCD_RAM13_S322      0x04
#define MASK_LCD_RAM13_S323      0x08
#define MASK_LCD_RAM13_S324      0x10
#define MASK_LCD_RAM13_S305      0x20
#define MASK_LCD_RAM13_S306      0x40
#define MASK_LCD_RAM13_S327      0x80

#define MASK_LCD_RAM14_S028      0x01
#define MASK_LCD_RAM14_S029      0x02
#define MASK_LCD_RAM14_S030      0x04
#define MASK_LCD_RAM14_S031      0x08
#define MASK_LCD_RAM14_S032      0x10
#define MASK_LCD_RAM14_S033      0x20
#define MASK_LCD_RAM14_S034      0x40
#define MASK_LCD_RAM14_S035      0x80

#define MASK_LCD_RAM15_S036      0x01
#define MASK_LCD_RAM15_S037      0x02
#define MASK_LCD_RAM15_S038      0x04
#define MASK_LCD_RAM15_S039      0x08
#define MASK_LCD_RAM15_S040      0x10
#define MASK_LCD_RAM15_S041      0x20
#define MASK_LCD_RAM15_S042      0x40
#define MASK_LCD_RAM15_S043      0x80

#define MASK_LCD_RAM16_S128      0x01
#define MASK_LCD_RAM16_S129      0x02
#define MASK_LCD_RAM16_S130      0x04
#define MASK_LCD_RAM16_S131      0x08
#define MASK_LCD_RAM16_S132      0x10
#define MASK_LCD_RAM16_S133      0x20
#define MASK_LCD_RAM16_S134      0x40
#define MASK_LCD_RAM16_S135      0x80

#define MASK_LCD_RAM17_S136      0x01
#define MASK_LCD_RAM17_S137      0x02
#define MASK_LCD_RAM17_S138      0x04
#define MASK_LCD_RAM17_S139      0x08
#define MASK_LCD_RAM17_S140      0x10
#define MASK_LCD_RAM17_S141      0x20
#define MASK_LCD_RAM17_S142      0x40
#define MASK_LCD_RAM17_S143      0x80

#define MASK_LCD_RAM18_S228      0x01
#define MASK_LCD_RAM18_S229      0x02
#define MASK_LCD_RAM18_S230      0x04
#define MASK_LCD_RAM18_S231      0x08
#define MASK_LCD_RAM18_S232      0x10
#define MASK_LCD_RAM18_S233      0x20
#define MASK_LCD_RAM18_S234      0x40
#define MASK_LCD_RAM18_S235      0x80

#define MASK_LCD_RAM19_S236      0x01
#define MASK_LCD_RAM19_S237      0x02
#define MASK_LCD_RAM19_S238      0x04
#define MASK_LCD_RAM19_S239      0x08
#define MASK_LCD_RAM19_S240      0x10
#define MASK_LCD_RAM19_S241      0x20
#define MASK_LCD_RAM19_S242      0x40
#define MASK_LCD_RAM19_S243      0x80

#define MASK_LCD_RAM20_S328      0x01
#define MASK_LCD_RAM20_S329      0x02
#define MASK_LCD_RAM20_S330      0x04
#define MASK_LCD_RAM20_S331      0x08
#define MASK_LCD_RAM20_S332      0x10
#define MASK_LCD_RAM20_S333      0x20
#define MASK_LCD_RAM20_S334      0x40
#define MASK_LCD_RAM20_S335      0x80

#define MASK_LCD_RAM21_S336      0x01
#define MASK_LCD_RAM21_S337      0x02
#define MASK_LCD_RAM21_S338      0x04
#define MASK_LCD_RAM21_S339      0x08
#define MASK_LCD_RAM21_S340      0x10
#define MASK_LCD_RAM21_S341      0x20
#define MASK_LCD_RAM21_S342      0x40
#define MASK_LCD_RAM21_S343      0x80


/*-------------------------------------------------------------------------
 *      RI register definitions
 *-----------------------------------------------------------------------*/
/* Timer input capture routing register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char IC2CS       : 5;
} __BITS_RI_ICR1;
#endif
__IO_REG8_BIT(RI_ICR1,     0x5431, __READ_WRITE, __BITS_RI_ICR1);

/* Timer input capture routing register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char IC3CS       : 5;
} __BITS_RI_ICR2;
#endif
__IO_REG8_BIT(RI_ICR2,     0x5432, __READ_WRITE, __BITS_RI_ICR2);

/* I/O input register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CH1I        : 1;
  unsigned char CH4I        : 1;
  unsigned char CH7I        : 1;
  unsigned char CH10I       : 1;
  unsigned char CH13I       : 1;
  unsigned char CH16I       : 1;
  unsigned char CH19I       : 1;
  unsigned char CH22I       : 1;
} __BITS_RI_IOIR1;
#endif
__IO_REG8_BIT(RI_IOIR1,    0x5433, __READ, __BITS_RI_IOIR1);

